{
  "Version": "233",
  "Year": "2025",
  "Semester": "spring",
  "project_name": "Modeling fires in California",
  "Objective": " \n            The goal is to create a tool (dashboard most likely) which will help Californians determine what areas are most prone to fires.  \n            This can help them to determine what areas are safest to build new developments, purchase real estate, or take preemptive action to defend their homes from fires.  \n            It will also provide a guideline which could allow state authorities to better optimize resource allocation, as well as determine what areas of wilderness may require additional fire observation posts.  \n            This will allow private users to determine what areas may be safest, and preferably, it could also be used by state authorities to help determine which areas require more resources to help prevent fires.  \n            On a microlevel, individuals could use it to inform themselves on how ready they need to be in the event of a fire in the area.  \n            On a macrolevel, it could allow for state fire departments to predict, or at least in some capacity, anticipate where a fire may be, and divert additional engines and air assets before the outbreak of a fire.  \n            This could massively help containment, and prevent fires growing out of control.\n \n            ",
  "Dataset": "\n            https://www.fire.ca.gov/incidents - \n            This database contains a csv and geo json fill containing all fires in California in recent years.  \n            This will be the basis of the map, as it will allow us to observe temporal trends, and diagnose which areas have seen repeat fires. \n            This is regulated and published by the state, so it is likely highly reliable.\n\n            https://www.fire.ca.gov/what-we-do/fire-resource-assessment-program/gis-mapping-and-data-analytics - \n            This database contains the rest of the data needed.  \n            Including critical resources such as land type, vegetation coverage, and past fire incident and their causes.  \n            Similarly, it contains key tangential data, such as administrative boundaries and cities.  \n            This is regulated and published by the state, so it is likely highly reliable.\n\n            https://data.ca.gov/ - This is a massive repository of open source data, including most importantly, utility lines and maps, which have historically caused many fires.  \n            This is state regulated, despite being open source, and is likely well vetted and reliable.\n  \n            ",
  "Rationale": "\n            This project is going to help both agency level and private users to analyze the risk of fires in the areas, improving resource allocation, fire awareness, and emergency response.\n            ",
  "Approach": "\n            I plan on approaching this capstone through several steps.  \n\n            1. Automate data capturing from Google Earth Engine (Python code in the engine).\n            2. Work on the covariate features importance.  \n            3. Use covariate features to model degree of poverty (Classical Models).\n            4. Use a model developed in on city and apply it to other cities (Transfer Learning)\n            5. Combine satellite images with covariate features.  \n            ",
  "Timeline": "\n            This a rough time line for this project:  \n\n            - (3 Weeks) Data Processing\n            \t- (3 Weeks) Feature Importance/Experiment with causes \n            \t- (1 Weeks) Compile  \n            \t- (3 Weeks) Data verification  \n            \t- (2 Weeks) Visualization/UI creation  \n            \t- (2 Week) Writing up the report/Beta testing\n            \t- (1 Week) Poster and Final Presentation  \n\n            ",
  "Expected Number Students": "\n            For this project maximum 1 students can work on it.  \n            ",
  "Possible Issues": "\n            Due to the large amounts of data, there may be challenges trying to link different data sources to each other.  Some work arounds may include using informal IDs like the names of counties, and then from there a formal numbered ID system will be implemented.  GIS tools also can be difficult to work with, so there exists a number of potentially unforeseen challenges originating from the rigidity of GIS tools, and potential limitations with their tools.  GWU has many licenses for advanced GIS tools, so there will likely be alternative methods to solve these problems, but it will take time to implement them.\n            ",
  "Proposed by": "Matthew Caldwell",
  "Proposed by email": "mcaldwell25@gwu.edu",
  "instructor": "Sushovan Majhi",
  "instructor_email": "s.majhi@gwu.edu",
  "github_repo": "https://github.com/GW-datasci/25-spring-MCALDWELL"
}